dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEmem_bf.h
/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM5 */
#define IFX_EMEM_TILECC_XCM5_OFF (13u)

/** \brief Length for Ifx_EMEM_TILECC_Bits.XCM6 */
#define IFX_EMEM_TILECC_XCM6_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECC_Bits.XCM6 */
#define IFX_EMEM_TILECC_XCM6_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM6 */
#define IFX_EMEM_TILECC_XCM6_OFF (14u)

/** \brief Length for Ifx_EMEM_TILECC_Bits.XCM7 */
#define IFX_EMEM_TILECC_XCM7_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECC_Bits.XCM7 */
#define IFX_EMEM_TILECC_XCM7_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM7 */
#define IFX_EMEM_TILECC_XCM7_OFF (15u)

/** \brief Length for Ifx_EMEM_TILECC_Bits.XCM8 */
#define IFX_EMEM_TILECC_XCM8_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECC_Bits.XCM8 */
#define IFX_EMEM_TILECC_XCM8_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM8 */
#define IFX_EMEM_TILECC_XCM8_OFF (16u)

/** \brief Length for Ifx_EMEM_TILECC_Bits.XCM9 */
#define IFX_EMEM_TILECC_XCM9_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECC_Bits.XCM9 */
#define IFX_EMEM_TILECC_XCM9_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM9 */
#define IFX_EMEM_TILECC_XCM9_OFF (17u)

/** \brief Length for Ifx_EMEM_TILECC_Bits.XCM10 */
#define IFX_EMEM_TILECC_XCM10_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECC_Bits.XCM10 */
#define IFX_EMEM_TILECC_XCM10_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM10 */
#define IFX_EMEM_TILECC_XCM10_OFF (18u)

/** \brief Length for Ifx_EMEM_TILECC_Bits.XCM11 */
#define IFX_EMEM_TILECC_XCM11_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECC_Bits.XCM11 */
#define IFX_EMEM_TILECC_XCM11_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM11 */
#define IFX_EMEM_TILECC_XCM11_OFF (19u)

/** \brief Length for Ifx_EMEM_TILECC_Bits.XCM12 */
#define IFX_EMEM_TILECC_XCM12_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECC_Bits.XCM12 */
#define IFX_EMEM_TILECC_XCM12_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM12 */
#define IFX_EMEM_TILECC_XCM12_OFF (20u)

/** \brief Length for Ifx_EMEM_TILECC_Bits.XCM13 */
#define IFX_EMEM_TILECC_XCM13_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECC_Bits.XCM13 */
#define IFX_EMEM_TILECC_XCM13_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM13 */
#define IFX_EMEM_TILECC_XCM13_OFF (21u)

/** \brief Length for Ifx_EMEM_TILECC_Bits.XCM14 */
#define IFX_EMEM_TILECC_XCM14_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECC_Bits.XCM14 */
#define IFX_EMEM_TILECC_XCM14_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM14 */
#define IFX_EMEM_TILECC_XCM14_OFF (22u)

/** \brief Length for Ifx_EMEM_TILECC_Bits.XCM15 */
#define IFX_EMEM_TILECC_XCM15_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECC_Bits.XCM15 */
#define IFX_EMEM_TILECC_XCM15_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECC_Bits.XCM15 */
#define IFX_EMEM_TILECC_XCM15_OFF (23u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM0 */
#define IFX_EMEM_TILECT_TCM0_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM0 */
#define IFX_EMEM_TILECT_TCM0_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM0 */
#define IFX_EMEM_TILECT_TCM0_OFF (0u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM1 */
#define IFX_EMEM_TILECT_TCM1_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM1 */
#define IFX_EMEM_TILECT_TCM1_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM1 */
#define IFX_EMEM_TILECT_TCM1_OFF (1u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM2 */
#define IFX_EMEM_TILECT_TCM2_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM2 */
#define IFX_EMEM_TILECT_TCM2_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM2 */
#define IFX_EMEM_TILECT_TCM2_OFF (2u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM3 */
#define IFX_EMEM_TILECT_TCM3_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM3 */
#define IFX_EMEM_TILECT_TCM3_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM3 */
#define IFX_EMEM_TILECT_TCM3_OFF (3u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM4 */
#define IFX_EMEM_TILECT_TCM4_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM4 */
#define IFX_EMEM_TILECT_TCM4_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM4 */
#define IFX_EMEM_TILECT_TCM4_OFF (4u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM5 */
#define IFX_EMEM_TILECT_TCM5_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM5 */
#define IFX_EMEM_TILECT_TCM5_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM5 */
#define IFX_EMEM_TILECT_TCM5_OFF (5u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM6 */
#define IFX_EMEM_TILECT_TCM6_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM6 */
#define IFX_EMEM_TILECT_TCM6_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM6 */
#define IFX_EMEM_TILECT_TCM6_OFF (6u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.TCM7 */
#define IFX_EMEM_TILECT_TCM7_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.TCM7 */
#define IFX_EMEM_TILECT_TCM7_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.TCM7 */
#define IFX_EMEM_TILECT_TCM7_OFF (7u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.XTM0 */
#define IFX_EMEM_TILECT_XTM0_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.XTM0 */
#define IFX_EMEM_TILECT_XTM0_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.XTM0 */
#define IFX_EMEM_TILECT_XTM0_OFF (16u)

/** \brief Length for Ifx_EMEM_TILECT_Bits.XTM1 */
#define IFX_EMEM_TILECT_XTM1_LEN (1u)

/** \brief Mask for Ifx_EMEM_TILECT_Bits.XTM1 */
#define IFX_EMEM_TILECT_XTM1_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_TILECT_Bits.XTM1 */
#define IFX_EMEM_TILECT_XTM1_OFF (17u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.TCM0 */
#define IFX_EMEM_TILESTATE_TCM0_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.TCM0 */
#define IFX_EMEM_TILESTATE_TCM0_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.TCM0 */
#define IFX_EMEM_TILESTATE_TCM0_OFF (0u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.TCM1 */
#define IFX_EMEM_TILESTATE_TCM1_LEN (2u)

/** \brief Mask for Ifx_EMEM_TILESTATE_Bits.TCM1 */
#define IFX_EMEM_TILESTATE_TCM1_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_TILESTATE_Bits.TCM1 */
#define IFX_EMEM_TILESTATE_TCM1_OFF (2u)

/** \brief Length for Ifx_EMEM_TILESTATE_Bits.TCM2 */
#define IFX_EMEM_TILESTATE_TCM2_LEN (2u)

